Reports/УнифицированнаяФормаП50.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>УнифицированнаяФормаП50</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/УнифицированнаяФормаП50.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>УнифицированнаяФормаП50</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КолонкаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УнифицированнаяФормаП50</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСРаботникамиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСРаботникамиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетовУпр</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСуммаНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьВидВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаиморасчетовСРаботниками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CalculationRegisters/Удержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<CalculationRegister>
		<Properties>
			<Name>Удержания</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Удержания</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатУпр</Name>
					<Comment>в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйРезультат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсполнительныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/УнифицированнаяФормаП50/Ext/ObjectModule.bsl
#Если Клиент Тогда
Функция ЗаголовокОтчета() Экспорт
		Возврат  НСтр("ru='Расчетная ведомость П - 50 ';uk='Розрахункова відомість П - 50 '");		
КонецФункции

	
Функция ПолучитьСписокИзНастроекОтчета(ТекущаяКолонка)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамКолонка", ТекущаяКолонка);
	ТекстЗапроса = "
	|ВЫБРАТЬ	
	|    Параметры.ВидРасчета  КАК ВидРасчета
	|ИЗ РегистрСведений.УнифицированнаяФормаП50 КАК Параметры
	|ГДЕ  Параметры.КолонкаОтчета = &парамКолонка
	|";
	Запрос.Текст = ТекстЗапроса;
	ТекущийСписок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета");

	Возврат ТекущийСписок;
	
КонецФункции
	
	
// Функция формирует основной запрос по сбору данных для расчетной ведомости.
//
// Параметры
//
// Возвращаемое значение:
//   РезультатЗапроса   – результат запроса.
//
Функция СформироватьЗапрос()
	
	ОтборРаботника     = (ТипЗнч(СохраненныеНастройки) = Тип("Структура"));
	ОтборОрганизации   = ОтборРаботника;
	ОтборПодразделения = ОтборРаботника;
	
	Если ОтборРаботника Тогда
		
		ОтборОрганизации		  = СохраненныеНастройки.ФлажокНастройкиОрганизация;
		ВидСравненияОрганизации	  = СохраненныеНастройки.ПолеВидаСравненияОрганизация;
		Организация				  = СохраненныеНастройки.ПолеНастройкиОрганизация;
		ОтборПодразделения		  = СохраненныеНастройки.ФлажокНастройкиПодразделение;
		ВидСравненияПодразделения = СохраненныеНастройки.ПолеВидаСравненияПодразделение;
		Подразделение			  = СохраненныеНастройки.ПолеНастройкиПодразделение;
		ОтборРаботника			  = СохраненныеНастройки.ФлажокНастройкиРаботник;
		ВидСравненияРаботника	  = СохраненныеНастройки.ПолеВидаСравненияРаботник;
		Работник				  = СохраненныеНастройки.ПолеНастройкиРаботник;
		
	КонецЕсли;
	
	НачПериода = НачалоМесяца(Период);
	КонПериода = КонецМесяца(Период);
	
	Запрос = Новый Запрос;
	
	Если ОтборОрганизации Тогда
		
		Запрос.УстановитьПараметр("ПарамОрганизация", Организация);
		ВидСравненияОрганизация = УправлениеОтчетами.ПолучитьВидСравненияСтрокой(ВидСравненияОрганизации)
		
	КонецЕсли;  
	
	Если ОтборПодразделения Тогда
		
		Запрос.УстановитьПараметр("ПарамПодразделение", Подразделение);
		ВидСравненияПодразделение = УправлениеОтчетами.ПолучитьВидСравненияСтрокой(ВидСравненияПодразделения)
		
	КонецЕсли;  
	
	Если ОтборРаботника Тогда
		
		Запрос.УстановитьПараметр("ПарамСотрудник", Работник);
	    ВидСравненияРаботник = УправлениеОтчетами.ПолучитьВидСравненияСтрокой(ВидСравненияРаботника)
		
	Иначе
		//Определение списка работников, попадающих в отчетный период
		
		ЗапросФЗ       = Новый Запрос;
		ЗапросФЗ.УстановитьПараметр("НачПериода",      НачПериода);
		ЗапросФЗ.УстановитьПараметр("КонПериода",      КонПериода);
		
		МассивВидЗанятости = Новый Массив(2);
		МассивВидЗанятости[0] = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы;
		МассивВидЗанятости[1] = Перечисления.ВидыЗанятостиВОрганизации.Совместительство;
		ЗапросФЗ.УстановитьПараметр("ПарамОсновнойСотрудник", МассивВидЗанятости);
		
		ЗапросФЗ.УстановитьПараметр("ПарамОрганизация",   Организация);
		ЗапросФЗ.УстановитьПараметр("ПарамПодразделение", Подразделение);
		ЗапросФЗ.УстановитьПараметр("Увольнение", Перечисления.ПричиныИзмененияСостояния.Увольнение);
		
		ЗапросФЗ.Текст ="
						|ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	РаботникиОрганизаций.Сотрудник КАК Сотрудник
		                |ИЗ
		                |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонПериода,
						|	"  + ?(ОтборОрганизации, " Организация " + ВидСравненияОрганизация + " (&ПарамОрганизация)", "") + "
						|		)КАК РаботникиОрганизаций
		                |
		                |ГДЕ РаботникиОрганизаций.ПричинаИзмененияСостояния <> &Увольнение  
						|	" + ?(ОтборПодразделения, " И РаботникиОрганизаций.ПодразделениеОрганизации "	+ ВидСравненияПодразделение + " (&ПарамПодразделение)", "") + "	
		                |
						|ОБЪЕДИНИТЬ
						|ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	РаботникиОрганизаций.Сотрудник КАК Сотрудник
		                |
		                |ИЗ	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		                |
		                |ГДЕ	НАЧАЛОПЕРИОДА( РаботникиОрганизаций.Период, МЕСЯЦ ) = &НачПериода
						|		И РаботникиОрганизаций.ПричинаИзмененияСостояния = &Увольнение
		                |	" + ?(ОтборОрганизации, " И РаботникиОрганизаций.Организация " + ВидСравненияОрганизация + " (&ПарамОрганизация)", "") + "
		                |   " + ?(ОтборПодразделения, " И РаботникиОрганизаций.ПодразделениеОрганизации " + ВидСравненияПодразделение + " (&ПарамПодразделение)", "")+ "	
						|"; 

										
		Запрос.УстановитьПараметр("парамСотрудник", ЗапросФЗ.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник"));
		ВидСравненияРаботник = "В";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачПериода",             НачПериода);
	Запрос.УстановитьПараметр("КонПериода",             КонПериода);
	Запрос.УстановитьПараметр("СледующийМесяц",         КонПериода + 1);
	Запрос.УстановитьПараметр("ВидДвиженияПриход",      ВидДвиженияНакопления.Приход);
	
	Запрос.УстановитьПараметр("ПарамАванс",        Справочники.ВидыВыплат.Аванс);
	
	МассивОсновнойСотрудник = Новый Массив(2);
	МассивОсновнойСотрудник[0] = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы;
	МассивОсновнойСотрудник[1] = Перечисления.ВидыЗанятостиВОрганизации.Совместительство;
	Запрос.УстановитьПараметр("ПарамОсновнойСотрудник", МассивОсновнойСотрудник);
	
	Запрос.УстановитьПараметр("ПарамСпособРасчетаВзносыВФонды", Перечисления.СпособыРасчетаОплатыТруда.Взносы);
	
	// Основные начисления
	ОсновныеНачисления = ПланыВидовРасчета.Начисления;
	
	СправочникНачтройки = Справочники.УнифицированнаяФормаП50;
	Запрос.УстановитьПараметр("ПарамНаряды",		ПолучитьСписокИзНастроекОтчета(СправочникНачтройки.ДоплатыНаряды));
	Запрос.УстановитьПараметр("ПарамПочасово",		ПолучитьСписокИзНастроекОтчета(СправочникНачтройки.ДоплатыПочасово));
	Запрос.УстановитьПараметр("ПарамНочь",			ПолучитьСписокИзНастроекОтчета(СправочникНачтройки.ДоплатыЗаНочь));
	Запрос.УстановитьПараметр("ПарамСверхурочные",	ПолучитьСписокИзНастроекОтчета(СправочникНачтройки.ДоплатыЗаСверхурочные));
	Запрос.УстановитьПараметр("ПарамПростои", 		ПолучитьСписокИзНастроекОтчета(СправочникНачтройки.ДоплатыЗаПростои));
	Запрос.УстановитьПараметр("ПарамОтпуск", 		ПолучитьСписокИзНастроекОтчета(СправочникНачтройки.ДоплатыЗаОтпуск));
	Запрос.УстановитьПараметр("ПарамБольничный",	ПолучитьСписокИзНастроекОтчета(СправочникНачтройки.ДоплатыЗаБольничный));
	Запрос.УстановитьПараметр("ПарамПремии", 		ПолучитьСписокИзНастроекОтчета(СправочникНачтройки.ДоплатыПремии));
	
	// Удержания
	Запрос.УстановитьПараметр("ПарамИсполнительныеЛисты", ПолучитьСписокИзНастроекОтчета(СправочникНачтройки.УдержаноПоИсполнительнымЛистам));
	Запрос.УстановитьПараметр("УдержаноДругие", ПолучитьСписокИзНастроекОтчета(СправочникНачтройки.УдержаноДругие));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизаций.Организация                           КАК Организация,
	|	ВЫРАЗИТЬ(РаботникиОрганизаций.Организация.НаименованиеПолное
	|	                              КАК СТРОКА(1000))            КАК ОрганизацияНаименованиеПолное,
	|	РаботникиОрганизаций.ПодразделениеОрганизации              КАК ПодразделениеОрганизации,
	|	РаботникиОрганизаций.ПодразделениеОрганизации.Наименование КАК ПодразделениеНаименование,
	|	РаботникиОрганизаций.Сотрудник                               КАК ФизЛицо,
	|	РаботникиОрганизаций.Сотрудник.ФизЛицо.Наименование                  КАК ФИО,
	|	ПриемНаРаботуВОрганизацию.Сотрудник.Код                   КАК ТабельныйНомер,
	|	ОсновныеНачисления.ДоплатыНаряды                           КАК ДоплатыНаряды,
	|	ОсновныеНачисления.ДоплатыПочасово                         КАК ДоплатыПочасово,
	|	ОсновныеНачисления.ДоплатыЗаНочь                           КАК ДоплатыЗаНочь,
	|	ОсновныеНачисления.ДоплатыЗаСверхурочные                   КАК ДоплатыЗаСверхурочные,
	|	ОсновныеНачисления.ДоплатыЗаПростои                        КАК ДоплатыЗаПростои,
	|	ОсновныеНачисления.ДоплатыЗаОтпуск                         КАК ДоплатыЗаОтпуск,
	|	ОсновныеНачисления.ДоплатыЗаОтпускСледующий                КАК ДоплатыЗаОтпускСледующий,
	|	ОсновныеНачисления.БольничныйДни                           КАК БольничныйДни,
	|	ОсновныеНачисления.ДоплатыЗаБольничный                     КАК ДоплатыЗаБольничный,
	|	ОсновныеНачисления.ДоплатыВсегоОсновныеНачисления          КАК ДоплатыВсегоОсновныеНачисления,
	|	ОсновныеНачисления.ДоплатыПремии                     КАК ДоплатыПремии,
	|	Взаиморасчеты.УдержаноАванс                                КАК УдержаноАванс,
	|	Взаиморасчеты.УдержаноМежрасчетные                         КАК УдержаноМежрасчетные,
	|	Взаиморасчеты.ВсегоВыплаты                                 КАК ВсегоВыплаты,
	|	ВзаиморасчетыПоНДФЛ.УдержаноНДФЛ                           КАК УдержаноНДФЛ,
	|	ВзаиморасчетыПоНДФЛ.УдержаноНДФЛСледующий                  КАК УдержаноНДФЛСледующий,
	|	ВзаиморасчетыПоНДФЛ.УдержаноВсегоНДФЛ                      КАК УдержаноВсегоНДФЛ,
	|	ВзносыВФонды.УдержаноВсегоФонды                            КАК УдержаноВсегоФонды,
	|	Удержания.УдержаноПоИсполнительнымЛистам                   КАК УдержаноПоИсполнительнымЛистам,
	|	Удержания.УдержаноВсегоУдержания                           КАК УдержаноВсегоУдержания
	|ИЗ (
	|   	ВЫБРАТЬ
	|			Работники.Организация               КАК Организация,
	|			Работники.Сотрудник                   КАК Сотрудник,
	|			Работники1.ПодразделениеОрганизации	КАК ПодразделениеОрганизации
	|		ИЗ (	
	|			ВЫБРАТЬ
	|				РаботникиОрганизаций.Организация,
	|				РаботникиОрганизаций.Сотрудник,
	|				МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период
	|			ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|			ГДЕ	РаботникиОрганизаций.Сотрудник " + ВидСравненияРаботник + " (&парамСотрудник)
	|			" + ?(ОтборОрганизации, " И РаботникиОрганизаций.Организация " + ВидСравненияОрганизация + " (&ПарамОрганизация)", "") + "
	|   		СГРУППИРОВАТЬ ПО
	|				РаботникиОрганизаций.Организация,
	|				РаботникиОрганизаций.Сотрудник
	|		) КАК Работники
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники1
	|		ПО		Работники.Сотрудник     = Работники1.Сотрудник 
	|			И	Работники.Организация = Работники1.Организация
	|			И	Работники.Период = Работники1.Период
	|
	|       ГДЕ ИСТИНА
	|		"+ ?(ОтборПодразделения, " И Работники1.ПодразделениеОрганизации " + ВидСравненияПодразделение+ " (&ПарамПодразделение)", "") + "
	|) КАК РаботникиОрганизаций
	|
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизацию
	|По 	ПриемНаРаботуВОрганизацию.Сотрудник = РаботникиОрганизаций.Сотрудник
	|	И	ПриемНаРаботуВОрганизацию.Ссылка.Проведен
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|		ВЫБРАТЬ
	|			ОсновныеНачисления.Организация КАК Организация,
	|			ОсновныеНачисления.Сотрудник     КАК Сотрудник,
	|			СУММА(ВЫБОР 
	|			      	КОГДА ОсновныеНачисления.ВидРасчета В (&ПарамНаряды) 
	|			      		ТОГДА ОсновныеНачисления.Результат 
	|			      	ИНАЧЕ 0 
	|			      КОНЕЦ) КАК ДоплатыНаряды,
	|			СУММА(ВЫБОР 
	|			      	КОГДА ОсновныеНачисления.ВидРасчета В (&ПарамПочасово) 
	|			      		ТОГДА ОсновныеНачисления.Результат 
	|			      	ИНАЧЕ 0 
	|			      КОНЕЦ) КАК ДоплатыПочасово,
	|			СУММА(ВЫБОР 
	|			      	КОГДА ОсновныеНачисления.ВидРасчета В (&ПарамНочь) 
	|			      		ТОГДА ОсновныеНачисления.Результат 
	|			      	ИНАЧЕ 0 
	|			      КОНЕЦ) КАК ДоплатыЗаНочь,
	|			СУММА(ВЫБОР 
	|			      	КОГДА ОсновныеНачисления.ВидРасчета В (&ПарамСверхурочные) 
	|			      		ТОГДА ОсновныеНачисления.Результат 
	|			      	ИНАЧЕ 0 
	|			      КОНЕЦ) КАК ДоплатыЗаСверхурочные,
	|			СУММА(ВЫБОР 
	|			      	КОГДА ОсновныеНачисления.ВидРасчета В (&ПарамПростои) 
	|			      		ТОГДА ОсновныеНачисления.Результат 
	|			      	ИНАЧЕ 0 
	|			      КОНЕЦ) КАК ДоплатыЗаПростои,
	|			СУММА(ВЫБОР 
	|			      	КОГДА ОсновныеНачисления.ВидРасчета В (&ПарамОтпуск) И
	|			      	      ОсновныеНачисления.БазовыйПериодНачало = &НачПериода 
	|			      		ТОГДА ОсновныеНачисления.Результат 
	|			      	ИНАЧЕ 0 
	|			      КОНЕЦ) КАК ДоплатыЗаОтпуск,
	|			СУММА(ВЫБОР 
	|			      	КОГДА ОсновныеНачисления.ВидРасчета В (&ПарамОтпуск) И
	|			      	      ОсновныеНачисления.БазовыйПериодНачало = &СледующийМесяц 
	|			      		ТОГДА ОсновныеНачисления.Результат 
	|			      	ИНАЧЕ 0 
	|			      КОНЕЦ) КАК ДоплатыЗаОтпускСледующий,
	|			СУММА(ВЫБОР 
	|			      	КОГДА ОсновныеНачисления.ВидРасчета В (&ПарамБольничный) 
	|			      		ТОГДА ОсновныеНачисления.ОтработаноДней // НормаДней 
	|			      	ИНАЧЕ 0 
	|			      КОНЕЦ) КАК БольничныйДни,
	|			СУММА(ВЫБОР 
	|			      	КОГДА ОсновныеНачисления.ВидРасчета В (&ПарамБольничный) 
	|			      		ТОГДА ОсновныеНачисления.Результат 
	|			      	ИНАЧЕ 0 
	|			      КОНЕЦ) КАК ДоплатыЗаБольничный,
	|			СУММА(ОсновныеНачисления.Результат) КАК ДоплатыВсегоОсновныеНачисления,
	|			СУММА(ВЫБОР 
	|		          	КОГДА ОсновныеНачисления.ВидРасчета В (&ПарамПремии) 
	|		          		ТОГДА ОсновныеНачисления.Результат 
	|		          	ИНАЧЕ 0 
	|		          КОНЕЦ) КАК ДоплатыПремии
	|		ИЗ
	|			РегистрРасчета.Начисления КАК ОсновныеНачисления
	|		
	|		ГДЕ
	|			ОсновныеНачисления.ПериодРегистрации = &НачПериода И
	|			ОсновныеНачисления.Сотрудник " + ВидСравненияРаботник + " (&парамСотрудник)" 
	            + ?(ОтборОрганизации, " И ОсновныеНачисления.Организация "
				+ ВидСравненияОрганизация + " (&ПарамОрганизация)", "") + "
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОсновныеНачисления.Организация,
	|			ОсновныеНачисления.Сотрудник) КАК ОсновныеНачисления
	|		ПО РаботникиОрганизаций.Сотрудник     = ОсновныеНачисления.Сотрудник И
	|		   РаботникиОрганизаций.Организация = ОсновныеНачисления.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|		(ВЫБРАТЬ
	|			Взаиморасчеты.Организация КАК Организация,
	|			Взаиморасчеты.Сотрудник     КАК Сотрудник,
	|			СУММА(ВЫБОР 
	|		          	КОГДА Взаиморасчеты.Ведомость.ВидВыплаты = ЗНАЧЕНИЕ(Справочник.ВидыВыплат.Аванс) 
	|		          		ТОГДА Взаиморасчеты.СуммаВзаиморасчетов 
	|		          	ИНАЧЕ 0 
	|		          КОНЕЦ) КАК УдержаноАванс,
	|			СУММА(ВЫБОР 
	|		          	КОГДА НЕ Взаиморасчеты.Ведомость.ВидВыплаты.Предопределенный
	|		          		ТОГДА Взаиморасчеты.СуммаВзаиморасчетов 
	|		          	ИНАЧЕ 0 
	|		          КОНЕЦ) КАК УдержаноМежрасчетные,
	|			СУММА(Взаиморасчеты.СуммаВзаиморасчетов) КАК ВсегоВыплаты
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Взаиморасчеты
	|		
	|		ГДЕ		Взаиморасчеты.Период МЕЖДУ &НачПериода И &КонПериода
	|			И	Взаиморасчеты.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Выплата) 
	|			И	(НЕ Взаиморасчеты.Ведомость.ВидВыплаты.Предопределенный 
	|			ИЛИ Взаиморасчеты.Ведомость.ВидВыплаты = ЗНАЧЕНИЕ(Справочник.ВидыВыплат.Аванс))
	|			И	Взаиморасчеты.Сотрудник " + ВидСравненияРаботник + " (&парамСотрудник)"
				+ ?(ОтборОрганизации, " И Взаиморасчеты.Организация "
				+ ВидСравненияОрганизация + " (&ПарамОрганизация)", "") + "
	|		                                                     
	|		СГРУППИРОВАТЬ ПО
	|			Взаиморасчеты.Организация,
	|			Взаиморасчеты.Сотрудник) КАК Взаиморасчеты
	|		ПО РаботникиОрганизаций.Сотрудник     = Взаиморасчеты.Сотрудник И
	|		   РаботникиОрганизаций.Организация = Взаиморасчеты.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|		(ВЫБРАТЬ
	|			Удержания.Организация КАК Организация,
	|			Удержания.Сотрудник     КАК Сотрудник,
	|			СУММА(ВЫБОР 
	|		          	КОГДА Удержания.ВидРасчета В (&ПарамИсполнительныеЛисты) 
	|		          		ТОГДА Удержания.Результат 
	|		          	ИНАЧЕ 0
	|		          КОНЕЦ) КАК УдержаноПоИсполнительнымЛистам,
	|			СУММА(Удержания.Результат) КАК УдержаноВсегоУдержания
	|		ИЗ
	|			РегистрРасчета.Удержания КАК Удержания
	|		
	|		ГДЕ
	|			Удержания.ПериодРегистрации            = &НачПериода И
	|			Удержания.Сотрудник " + ВидСравненияРаботник + " (&парамСотрудник)"
				+ ?(ОтборОрганизации, " И Удержания.Организация "
				+ ВидСравненияОрганизация + " (&ПарамОрганизация)", "") + "
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Удержания.Организация,
	|			Удержания.Сотрудник) КАК Удержания
	|		ПО РаботникиОрганизаций.Сотрудник     = Удержания.Сотрудник И
	|		   РаботникиОрганизаций.Организация = Удержания.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|		(ВЫБРАТЬ
	|			ВзносыВФонды.Организация КАК Организация,
	|			ВзносыВФонды.Сотрудник     КАК Сотрудник,
	|			СУММА(ВзносыВФонды.Результат) КАК УдержаноВсегоФонды
	|		ИЗ
	|			РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|		
	|		ГДЕ
	|			ВзносыВФонды.ПериодРегистрации        = &НачПериода И
	|			ВзносыВФонды.ВидРасчета.СпособРасчета = &ПарамСпособРасчетаВзносыВФонды И
	|			ВзносыВФонды.Сотрудник " + ВидСравненияРаботник + " (&парамСотрудник)"
				+ ?(ОтборОрганизации, " И ВзносыВФонды.Организация "
				+ ВидСравненияОрганизация + " (&ПарамОрганизация)", "") + "
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВзносыВФонды.Организация,
	|			ВзносыВФонды.Сотрудник) КАК ВзносыВФонды
	|		ПО РаботникиОрганизаций.Сотрудник     = ВзносыВФонды.Сотрудник И
	|		   РаботникиОрганизаций.Организация = ВзносыВФонды.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|		(ВЫБРАТЬ
	|			ВзаиморасчетыПоНДФЛ.Организация КАК Организация,
	|			ВзаиморасчетыПоНДФЛ.Сотрудник     КАК Сотрудник,
	|			СУММА(ВЫБОР 
	|		          	КОГДА ВзаиморасчетыПоНДФЛ.НалоговыйПериод = &НачПериода 
	|		          		ТОГДА ВзаиморасчетыПоНДФЛ.Налог 
	|		          	ИНАЧЕ 0 
	|		          КОНЕЦ) КАК УдержаноНДФЛ,
	|			СУММА(ВЫБОР 
	|		          	КОГДА ВзаиморасчетыПоНДФЛ.НалоговыйПериод = &СледующийМесяц 
	|		          		ТОГДА ВзаиморасчетыПоНДФЛ.Налог 
	|		          	ИНАЧЕ 0 
	|		          КОНЕЦ) КАК УдержаноНДФЛСледующий,
	|			СУММА(ВзаиморасчетыПоНДФЛ.Налог) КАК УдержаноВсегоНДФЛ
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыПоНДФЛ КАК ВзаиморасчетыПоНДФЛ
	|		
	|		ГДЕ
	|			ВзаиморасчетыПоНДФЛ.Период МЕЖДУ &НачПериода И &КонПериода И
	|			ВзаиморасчетыПоНДФЛ.ВидДвижения = &ВидДвиженияПриход И
	|			ВзаиморасчетыПоНДФЛ.Сотрудник " + ВидСравненияРаботник + " (&парамСотрудник)"
				+ ?(ОтборОрганизации, " И ВзаиморасчетыПоНДФЛ.Организация "
				+ ВидСравненияОрганизация + " (&ПарамОрганизация)", "") + "
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВзаиморасчетыПоНДФЛ.Организация,
	|			ВзаиморасчетыПоНДФЛ.Сотрудник	
	|) КАК ВзаиморасчетыПоНДФЛ
	|ПО		РаботникиОрганизаций.Сотрудник     = ВзаиморасчетыПоНДФЛ.Сотрудник 
	|	И	РаботникиОрганизаций.Организация = ВзаиморасчетыПоНДФЛ.Организация
	|
	|ИТОГИ  СУММА(ДоплатыНаряды), 
	|       СУММА(ДоплатыПочасово),
	|       СУММА(ДоплатыЗаНочь),
	|       СУММА(ДоплатыЗаСверхурочные),
	|       СУММА(ДоплатыЗаПростои), 
	|       СУММА(ДоплатыЗаОтпуск), 
	|       СУММА(ДоплатыЗаОтпускСледующий), 
	|       СУММА(ДоплатыЗаБольничный), 
	|       СУММА(ДоплатыВсегоОсновныеНачисления), 
	|       СУММА(ДоплатыПремии), 
	|       СУММА(УдержаноАванс), 
	|       СУММА(УдержаноМежрасчетные), 
	|       СУММА(ВсегоВыплаты), 
	|       СУММА(УдержаноНДФЛ), 
	|       СУММА(УдержаноНДФЛСледующий), 
	|       СУММА(УдержаноВсегоНДФЛ), 
	|       СУММА(УдержаноВсегоФонды), 
	|       СУММА(УдержаноПоИсполнительнымЛистам), 
	|       СУММА(УдержаноВсегоУдержания) 
	|   ПО
	|	Организация,
	|	ПодразделениеОрганизации
	|
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Процедура заполняет параметры области 
// табличного документа по строке выборки.
// Вызывается из процедуры СформироватьОтчет
Процедура ЗаполнитьПараметры(Параметры, Выборка)
	
	Параметры.Заполнить(Выборка);
	
	ДоплатыЗаОтпуск           = ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.ДоплатыЗаОтпуск); 
	Параметры.ДоплатыЗаОтпуск = ДоплатыЗаОтпуск;
	ДоплатыВсего              = ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.ДоплатыВсегоОсновныеНачисления);
	Параметры.ДоплатыВсего    = ДоплатыВсего;
	Параметры.ДоплатыДругие   = ДоплатыВсего
	                            - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.ДоплатыНаряды)
	                            - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.ДоплатыПочасово)
							    - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.ДоплатыЗаНочь)
							    - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.ДоплатыЗаСверхурочные)
							    - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.ДоплатыЗаПростои)
							    - ДоплатыЗаОтпуск
							    - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.ДоплатыЗаОтпускСледующий)
							    - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.ДоплатыЗаБольничный)
							    - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.ДоплатыПремии);
	УдержаноВсего          	  = ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.ВсегоВыплаты)
	                            + ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.УдержаноВсегоНДФЛ)
							    + ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.УдержаноВсегоФонды)
							    + ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.УдержаноВсегоУдержания);
    Параметры.УдержаноВсего   = УдержаноВсего;
    Параметры.УдержаноДругие  = УдержаноВсего
	                            - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.УдержаноАванс)
	                            - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.УдержаноМежрасчетные)
	                            - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.УдержаноНДФЛ)
	                            - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.УдержаноНДФЛСледующий)
	                            - ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.УдержаноПоИсполнительнымЛистам);
	Параметры.КВыплате        = ДоплатыВсего - УдержаноВсего;

КонецПроцедуры // ЗаполнитьПараметры()

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт
	
	ДокументРезультат.Очистить(); 
	
	Макет 			  	  = ПолучитьМакет("П50");
	ОбластьШапка		  = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаЦех		  = Макет.ПолучитьОбласть("ШапкаЦех");
	ОбластьШапкаТаблицы   = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока         = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал         = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвалТаблицы  = Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	ПараметрыШапка  = ОбластьШапка.Параметры;
	ПараметрыШапкаЦех  = ОбластьШапкаЦех.Параметры;
	ПараметрыСтрока = ОбластьСтрока.Параметры;
	ПараметрыПодвал = ОбластьПодвалТаблицы.Параметры;
	
	ПараметрыШапка.ПериодОтчета = "за " + Формат(Период, "Л="+Локализация.ОпределитьКодЯзыкаДляФормат(Локализация.КодЯзыкаИнтерфейса())+"; ДФ='MMMM yyyy'");
	КонМесяца = КонецМесяца(Период);
	
	ОтборРаботника = (ТипЗнч(СохраненныеНастройки) = Тип("Структура"));
	
	Если ОтборРаботника Тогда
		
		ОтборРаботника = СохраненныеНастройки.ФлажокНастройкиРаботник;
		
		Если ОтборРаботника Тогда
			
			ВидСравненияРаботника	          = СохраненныеНастройки.ПолеВидаСравненияРаботник;
			Работник				          = СохраненныеНастройки.ПолеНастройкиРаботник;
			ПараметрыШапка.ОтборПоСотрудникам = "Отбор по сотрудникам: " + ВидСравненияРаботника
			                                    + " - " + Работник; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	РезультатЗапроса = СформироватьЗапрос();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Сообщить(НСтр("ru='Данные не обнаружены!';uk='Дані не знайдені!'"));
	    Возврат;
		
	КонецЕсли;
	
	ВыборкаПоОрганизациям = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СписокПоказателей     = Новый СписокЗначений;
	СписокПоказателей.Добавить("","ФИОРук");
	СписокПоказателей.Добавить("","ФИОБух");
	СписокПоказателей.Добавить("","КодПоЕДРПОУ");
	
	Пока ВыборкаПоОрганизациям.Следующий() Цикл
		
		ПараметрыШапка.ОрганизацияНаименованиеПолное = СокрП(ВыборкаПоОрганизациям.ОрганизацияНаименованиеПолное);
		
		СведенияОбОрганизации = РегламентированнаяОтчетность.ПолучитьСведенияОбОрганизации(ВыборкаПоОрганизациям.Организация, КонМесяца, СписокПоказателей);
		КодЕДРПОУ             = СокрЛП(СведенияОбОрганизации.КодПоЕДРПОУ);
		Для Инд = 1 По 10 Цикл
			ОбластьШапка.Рисунки["ЕДРПОУ" + Инд].Текст = Сред(КодЕДРПОУ, Инд, 1);
		КонецЦикла; 

		
		ВыборкаПодразделение = ВыборкаПоОрганизациям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПодразделение.Следующий() Цикл
		
			// Разделитель строки для следующего подразделения
			Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
				
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц()
				
			КонецЕсли;
		
			ПараметрыШапка.ПодразделениеНаименование = ВыборкаПодразделение.ПодразделениеНаименование;
			Если ПоказыватьЗаголовок Тогда
				ДокументРезультат.Вывести(ОбластьШапка);
			Иначе
				ОбластьШапкаЦех.Параметры.ПодразделениеНаименование = ВыборкаПодразделение.ПодразделениеНаименование;
				ДокументРезультат.Вывести(ОбластьШапкаЦех);
			КонецЕсли;
			ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
		    ВыборкаФЛ = ВыборкаПодразделение.Выбрать();
			НомПП = 0;
			Пока ВыборкаФЛ.Следующий() Цикл
				
				НомПП = НомПП + 1;
				ЗаполнитьПараметры(ПараметрыСтрока, ВыборкаФЛ);
				ПараметрыСтрока.НомПП 		= НомПП;
				ПараметрыСтрока.Расшифровка = ВыборкаФЛ.ФизЛицо;
				
				Если Не ДокументРезультат.ПроверитьВывод(ОбластьСтрока) Тогда
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
					
				КонецЕсли;
				
				ДокументРезультат.Вывести(ОбластьСтрока);
			
			КонецЦикла;
			
			ЗаполнитьПараметры(ПараметрыПодвал, ВыборкаПодразделение);
			
			Если Не (ДокументРезультат.ПроверитьВывод(ОбластьПодвалТаблицы) И ?(ПоказыватьЗаголовок,ДокументРезультат.ПроверитьВывод(ОбластьПодвал), Истина)) Тогда
				
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
				
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьПодвалТаблицы);
			Если ПоказыватьЗаголовок Тогда
				ДокументРезультат.Вывести(ОбластьПодвал);
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСлева  = 5;
	ДокументРезультат.ПолеСправа = 5;
				
КонецПроцедуры	

#КонецЕсли
